Revit 2026 API

# MasonryCMUPatternType Enumeration

---

The enumerated type representing the permitted values for the asset property "MasonryCMUPattern" from the "MasonryCMU" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MasonryCMUPatternType
```
```vb
Public Enumeration MasonryCMUPatternType
```
```cpp
public enum class MasonryCMUPatternType
```
```fsharp
type MasonryCMUPatternType
```

| Member name | Value | Description |
| --- | --- | --- |
| Custom | 1 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace